/*адача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число болешее, а какое меньшее.*/

/*Console.WriteLine("Введите два числа:");
int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
int max = 0;
int min = 0;
if(a==b){
    Console.WriteLine("Числа равны");
}
if (a > b)
{
    max = a;
    min = b;
}
else
{
    max = b;
    min = a;
}
Console.WriteLine("max="+max+"");
Console.WriteLine("min="+min+"");*/

/* Задача 4: Напишите программу, которая на вход принимает три числа и выдаёт максимальное из этих чисел.*/
/*Console.WriteLine("Введите три числа:");
int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
int c = int.Parse(Console.ReadLine());
int max = 0;
if(a>max)
{
    max=a;
}
if(b>max)
{
    max=b;
}
if(c>max)
{
    max=c;
}
Console.WriteLine("max="+max);*/
/* Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли оно четным(делится ли оно наидва без остатка)*/
/*Console.WriteLine("Введите число:");
int a = int.Parse(Console.ReadLine());
int rezult = a%2;
if(rezult == 0)
{
    Console.WriteLine("Число является четным");
}
else
{
Console.WriteLine("Число является НЕчетным");
}*/

/* Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.*/
/*Console.WriteLine("Введите число:");
int a = int.Parse(Console.ReadLine());
int firstZnachenie = 2;
if(a>1)
{
    while(firstZnachenie<=a)
    {
Console.Write(firstZnachenie + " ");
firstZnachenie = firstZnachenie + 2;
    } 
}
*/

